// Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
// a = 5; b = 7 -> max = 7
// a = 2 b = 10 -> max = 10
// a = -9 b = -3 -> max = -3

int numberOne = 2;
int numberTwo = 10;

if(numberOne > numberTwo)
{
    Console.WriteLine(numberOne);
}
else
{
    Console.WriteLine(numberTwo);
}

