// Напишите программу, которая на вход принимает число (N), 
// а на выходе показывает все четные числа от 1 до N
// 5 -> 2,4
// 8 -> 2, 4, 6, 8

int start = 2;
int n = 10;

while(start <= n )
{
    Console.WriteLine(start + "  ");
    start = start + 2;
}