// Дан массив, нужно сформировать новый массив из четных чисел

// 1. Нужно задать кол-во элементов
// 2. Нужно задать массив, в котором храняться элементы
// 3. Заполнить массив случайными числами
// 4. Распечатать исходный массив
// 5. Найти кол-во четных чисел в исходном массиве
// 6. Задать массив, в котором будут четные числа
// 7. Заполнить массив, в котором будут четные числа
// 8. Распечатать массив, в котором хранятся четные числа

// 1. Нужно задать кол-во элементов
int size = new Random().Next(10, 20);

// 2. Нужно задать массив, в котором храняться элементы
int[] source = new int[size];

// 3. Заполнить массив случайными числами


